class Text:
    
    start_text = 'Здравствуй, товарищ!\nНапиши свою почту и бот сохрнит её в базу данных. При повторном вводе, сохраненная почта поменяется на новую.'

    email_save = 'Почта сохранена!'

    your_email = 'Почта которую Вы сохранили: {}'

    email_is_none = 'Вы ещё не отправили боту свою почту'

    delete_email = 'Ваша почта удалена из базы данных!'

    not_chat_member = 'Что бы бот мог сохранить Вашу почту, Вы должны быть членом рабочего чата СДР!'

    # ------------------------------------

    add_email = 'Напишите почту для сохранения её ботом'

    list_emails = 'Сохраненные Вами почты:{}'